In [1]:
import pandas as pd

df = pd.read_csv("house_prices.csv")

df.head()

,Property_ID,Area,Bedrooms,Bathrooms,Age,Location,Property_Type,Price
0,PROP0001,3712,4,3,36,Rural,House,22260000
1,PROP0002,1591,4,1,35,Suburb,House,16057500
2,PROP0003,1646,4,3,20,Rural,Villa,12730000
3,PROP0004,4814,1,2,13,City Center,Villa,50840000
4,PROP0005,800,4,2,38,Suburb,Apartment,10650000

In [2]:
import sqlite3

conn = sqlite3.connect("weather_pipeline.db")

print("Database created successfully")

conn.close()

Database created successfully

In [3]:
import sqlite3

conn = sqlite3.connect("weather_pipeline.db")

df.to_sql("house_prices", conn, if_exists="replace", index=False)

print("Table created and data inserted successfully")

conn.close()

Table created and data inserted successfully

In [6]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("weather_pipeline.db")

In [7]:
query = "SELECT * FROM house_prices LIMIT 5"
pd.read_sql(query, conn)

,Property_ID,Area,Bedrooms,Bathrooms,Age,Location,Property_Type,Price
0,PROP0001,3712,4,3,36,Rural,House,22260000
1,PROP0002,1591,4,1,35,Suburb,House,16057500
2,PROP0003,1646,4,3,20,Rural,Villa,12730000
3,PROP0004,4814,1,2,13,City Center,Villa,50840000
4,PROP0005,800,4,2,38,Suburb,Apartment,10650000

In [8]:
query = "SELECT COUNT(*) AS total_properties FROM house_prices"
pd.read_sql(query, conn)

   total_properties
0               300

In [9]:
query = "SELECT AVG(Price) AS average_price FROM house_prices"
pd.read_sql(query, conn)

   average_price
0   2.488366e+07

In [10]:
query = """
SELECT Location, AVG(Price) AS avg_price
FROM house_prices
GROUP BY Location
"""
pd.read_sql(query, conn)

      Location     avg_price
0  City Center  3.314979e+07
1        Rural  1.646143e+07
2       Suburb  2.510807e+07

In [11]:
query = """
SELECT Property_ID, Location, Property_Type, Price
FROM house_prices
ORDER BY Price DESC
LIMIT 1
"""
pd.read_sql(query, conn)

  Property_ID     Location Property_Type     Price
0    PROP0229  City Center         House  58700000

In [12]:
conn.close()
print("Database connection closed")

Database connection closed